const storeRU = {
  title: 'Каталог',
  catalogueDescription: 'Акционеры крупнейших компаний, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут объявлены нарушающими общечеловеческие нормы этики и морали. Являясь всего лишь частью общей картины, стремящиеся вытеснить традиционное производство, нанотехнологии и по сей день остаются уделом либералов, которые жаждут быть функционально разнесены на независимые элементы.',
  accordion: {
    1400: {
      date: 'C 1400 по 1499 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи',
      'Веккьетта',
      'Андреа Верроккьо',
      'Доменико Гирландайо',
      'Беноццо Гоццоли',
      'Граначчи, Франческо',
      'Грегорио ди Чекко',
      'Джованни да Удине',
      'Джованни ди Паоло',
      'Джорджоне',
      'Парентино, Бернардо',
      'Пезеллино',
      'Пьетро Перуджино',
      'Перуцци, Бальдассаре',
      'Пизанелло',
      'Пинтуриккьо'

      ],
    },
    1500: {
      date: 'C 1500 по 1599 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
    1600: {
      date: 'C 1600 по 1699 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
    1700: {
      date: 'C 1700 по 1799 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
    1800: {
      date: 'C 1800 по 1899 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
     ],
    },
    1900: {
      date: 'C 1800 по 1899 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
    2000: {
      date: 'C 1800 по 1899 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
  },
  accordionAPI: [
    {
      id: 1,
      uri: 'image_3.jpg',
      artistName: 'Доменико Гирландайо',
      years: '2 июня 1448 — 11 января 1494.',
      description: 'Один из ведущих флорентийских художников Кватроченто, основатель художественной династии, которую продолжили его брат Давид и сын Ридольфо. Глава художественной мастерской, где юный Микеланджело в течение года овладевал профессиональными навыками. Автор фресковых циклов, в которых выпукло, со всевозможными подробностями показана домашняя жизнь библейских персонажей (в их роли выступают знатные граждане Флоренции в костюмах того времени).'
    },
    {
      id: 2,
      uri: 'no_face.jpg',
      artistName: 'Бенедетто ди Биндо',
      years: '1380 — 1417.',
      description: 'Первое документальное упоминание имени художника датируется 20 ноября 1409 года, когда он получил заказ на роспись двух деревянных статуй святых покровителей Сиены — св. Виктора и св. Савиния, выполненных скульптором Франческо ди Вальдамбрино для Сиенского собора. В 1411—1412 годах Бенедетто работал над циклом фресок, посвящённых житию Марии в сакристии этого же собора. Согласно документам, ему помогали три художника — Гвалтьери ди Джованни, Никколо ди Нальдо и Джованни ди Биндино.'
    },
  ]
}
const storeFR = {
  title: 'Каталог',
  catalogueDescription: 'Акционеры крупнейших компаний, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут объявлены нарушающими общечеловеческие нормы этики и морали. Являясь всего лишь частью общей картины, стремящиеся вытеснить традиционное производство, нанотехнологии и по сей день остаются уделом либералов, которые жаждут быть функционально разнесены на независимые элементы.',
  accordion: {
    1400: {
      date: 'C 1400 по 1499 гг.',
      artists: [
        'Генин, Роберт Львович',
        'Герен, Пьер-Нарсис',
        'Герен, Шарль',
        'Гийом, Альберт',
        'Гимар, Эктор',
        'Гис, Константен',
        'Гиша, Леон',
        'Глез, Альбер',
        'Глейр, Марк Габриэль Шарль',
        'Гоген, Поль',
        'Гозиасон, Филипп Германович',
        'Гонсалес, Хулио',
        'Горен, Жан Альбер',
        'Готтлиб, Леопольд',
        'Гошерель, Леон',
        'Гравло, Юбер-Франсуа',
        'Грандон, Шарль',
        'Грановский, Самуэль',
        'Грассе, Эжен',
        'Гревен, Альфред',
        'Грёз, Жан-Батист',
        'Гринман, Илья Абрамович',
        'Гро, Антуан-Жан',
        'Гроссер, Борис Николаевич',
        'Гужон, Жан',
        'Гюго, Валентина'
      ],
    },
    1500: {
      date: 'C 1500 по 1599 гг.',
      artists: [
        'Генин, Роберт Львович',
        'Герен, Пьер-Нарсис',
        'Герен, Шарль',
        'Гийом, Альберт',
        'Гимар, Эктор',
        'Гис, Константен',
        'Гиша, Леон',
        'Глез, Альбер',
        'Глейр, Марк Габриэль Шарль',
        'Гоген, Поль',
        'Гозиасон, Филипп Германович',
        'Гонсалес, Хулио',
        'Горен, Жан Альбер',
        'Готтлиб, Леопольд',
        'Гошерель, Леон',
        'Гравло, Юбер-Франсуа',
        'Грандон, Шарль',
        'Грановский, Самуэль',
        'Грассе, Эжен',
        'Гревен, Альфред',
        'Грёз, Жан-Батист',
        'Гринман, Илья Абрамович',
        'Гро, Антуан-Жан',
        'Гроссер, Борис Николаевич',
        'Гужон, Жан',
        'Гюго, Валентина'
      ],
    },
    1600: {
      date: 'C 1600 по 1699 гг.',
      artists: [
        'Генин, Роберт Львович',
        'Герен, Пьер-Нарсис',
        'Герен, Шарль',
        'Гийом, Альберт',
        'Гимар, Эктор',
        'Гис, Константен',
        'Гиша, Леон',
        'Глез, Альбер',
        'Глейр, Марк Габриэль Шарль',
        'Гоген, Поль',
        'Гозиасон, Филипп Германович',
        'Гонсалес, Хулио',
        'Горен, Жан Альбер',
        'Готтлиб, Леопольд',
        'Гошерель, Леон',
        'Гравло, Юбер-Франсуа',
        'Грандон, Шарль',
        'Грановский, Самуэль',
        'Грассе, Эжен',
        'Гревен, Альфред',
        'Грёз, Жан-Батист',
        'Гринман, Илья Абрамович',
        'Гро, Антуан-Жан',
        'Гроссер, Борис Николаевич',
        'Гужон, Жан',
        'Гюго, Валентина'
      ],
    },
    1700: {
      date: 'C 1700 по 1799 гг.',
      artists: [
        'Генин, Роберт Львович',
        'Герен, Пьер-Нарсис',
        'Герен, Шарль',
        'Гийом, Альберт',
        'Гимар, Эктор',
        'Гис, Константен',
        'Гиша, Леон',
        'Глез, Альбер',
        'Глейр, Марк Габриэль Шарль',
        'Гоген, Поль',
        'Гозиасон, Филипп Германович',
        'Гонсалес, Хулио',
        'Горен, Жан Альбер',
        'Готтлиб, Леопольд',
        'Гошерель, Леон',
        'Гравло, Юбер-Франсуа',
        'Грандон, Шарль',
        'Грановский, Самуэль',
        'Грассе, Эжен',
        'Гревен, Альфред',
        'Грёз, Жан-Батист',
        'Гринман, Илья Абрамович',
        'Гро, Антуан-Жан',
        'Гроссер, Борис Николаевич',
        'Гужон, Жан',
        'Гюго, Валентина'
      ],
    },
    1800: {
      date: 'C 1800 по 1899 гг.',
      artists: [
        'Генин, Роберт Львович',
        'Герен, Пьер-Нарсис',
        'Герен, Шарль',
        'Гийом, Альберт',
        'Гимар, Эктор',
        'Гис, Константен',
        'Гиша, Леон',
        'Глез, Альбер',
        'Глейр, Марк Габриэль Шарль',
        'Гоген, Поль',
        'Гозиасон, Филипп Германович',
        'Гонсалес, Хулио',
        'Горен, Жан Альбер',
        'Готтлиб, Леопольд',
        'Гошерель, Леон',
        'Гравло, Юбер-Франсуа',
        'Грандон, Шарль',
        'Грановский, Самуэль',
        'Грассе, Эжен',
        'Гревен, Альфред',
        'Грёз, Жан-Батист',
        'Гринман, Илья Абрамович',
        'Гро, Антуан-Жан',
        'Гроссер, Борис Николаевич',
        'Гужон, Жан',
        'Гюго, Валентина'
     ],
    },
    1900: {
      date: 'C 1800 по 1899 гг.',
      artists: [
        'Генин, Роберт Львович',
        'Герен, Пьер-Нарсис',
        'Герен, Шарль',
        'Гийом, Альберт',
        'Гимар, Эктор',
        'Гис, Константен',
        'Гиша, Леон',
        'Глез, Альбер',
        'Глейр, Марк Габриэль Шарль',
        'Гоген, Поль',
        'Гозиасон, Филипп Германович',
        'Гонсалес, Хулио',
        'Горен, Жан Альбер',
        'Готтлиб, Леопольд',
        'Гошерель, Леон',
        'Гравло, Юбер-Франсуа',
        'Грандон, Шарль',
        'Грановский, Самуэль',
        'Грассе, Эжен',
        'Гревен, Альфред',
        'Грёз, Жан-Батист',
        'Гринман, Илья Абрамович',
        'Гро, Антуан-Жан',
        'Гроссер, Борис Николаевич',
        'Гужон, Жан',
        'Гюго, Валентина'
      ],
    },
    2000: {
      date: 'C 1800 по 1899 гг.',
      artists: [
        'Генин, Роберт Львович',
        'Герен, Пьер-Нарсис',
        'Герен, Шарль',
        'Гийом, Альберт',
        'Гимар, Эктор',
        'Гис, Константен',
        'Гиша, Леон',
        'Глез, Альбер',
        'Глейр, Марк Габриэль Шарль',
        'Гоген, Поль',
        'Гозиасон, Филипп Германович',
        'Гонсалес, Хулио',
        'Горен, Жан Альбер',
        'Готтлиб, Леопольд',
        'Гошерель, Леон',
        'Гравло, Юбер-Франсуа',
        'Грандон, Шарль',
        'Грановский, Самуэль',
        'Грассе, Эжен',
        'Гревен, Альфред',
        'Грёз, Жан-Батист',
        'Гринман, Илья Абрамович',
        'Гро, Антуан-Жан',
        'Гроссер, Борис Николаевич',
        'Гужон, Жан',
        'Гюго, Валентина'
      ],
    },
  },
  accordionAPI: [
    {
      id: 1,
      uri: 'genin.jpg',
      artistName: 'Генин, Роберт Львович',
      years: '11 августа 1884 — 16 августа 1941',
      description: `Роберт Генин родился 11 августа 1884 года в деревне Высокое (ныне Климовичский район Могилёвской области Белоруссии) в семье еврейского лавочника. В 1898—1900 годах учился в художественной школе академика Ивана Трутнева в Вильне, в 1900—1902 годах — в Одесском художественном училище.

      В конце 1902 года отправился в Мюнхен учиться в школе Антона Ашбе, но вскоре разочаровался в ней и в 1903 году переехал в Париж, где вместе с пятью товарищами жил коммуной.[8] В Париже познакомился с творчеством Пюви де Шаванна, чье влияние прослеживается в работах Генина вплоть до 1914 года. В автобиографии упоминал, что в 1904—1906 годах посещал Академию Жюлиана и высшие курсы социальных наук в Сорбонне. В 1905—1907 годах был обитателем «Улья».[9] В 1907 году впервые участвовал в выставке «Осеннего салона», где представил большую картину «Нищий». Вернувшись в Мюнхен в 1907 году, рисовал иллюстрации и карикатуры для журнала «Jugend» (всего опубликовано 40 иллюстраций). В 1912 году выполнил ряд эскизов настенной росписи на тему «Труд» для музея Штеттина. В 1911—1912 годах наряду с Альфредом Кубиным, Паулем Клее и другими входил в мюнхенскую группу «Sema»[10]. С 1913 года входил в группу «Münchener neue Secession». Во время Первой мировой войны был интернирован под Мюнхеном; несмотря на это в галерее Танхаузер в 1917 году была проведена его вторая персональная выставка. После окончания Первой мировой войны в конце 1918 года переехал в Берлин. В 1919 году приобрел небольшой домик в рыбацкой деревне Аскона в Швейцарии, где с тех пор проводил несколько месяцев в году. В 1929 году переехал из Берлина в Париж. С 1912 по 1933 год активно участвовал в художественных выставках в Германии, Швейцарии, Франции и Голландии. В 1926 году предпринял поездку на остров Бали.`
    },
    {
      id: 2,
      uri: 'no_face.jpg',
      artistName: 'Бенедетто ди Биндо',
      years: '1380 — 1417.',
      description: 'Первое документальное упоминание имени художника датируется 20 ноября 1409 года, когда он получил заказ на роспись двух деревянных статуй святых покровителей Сиены — св. Виктора и св. Савиния, выполненных скульптором Франческо ди Вальдамбрино для Сиенского собора. В 1411—1412 годах Бенедетто работал над циклом фресок, посвящённых житию Марии в сакристии этого же собора. Согласно документам, ему помогали три художника — Гвалтьери ди Джованни, Никколо ди Нальдо и Джованни ди Биндино.'
    },
  ]
}
const storeDE = {
  title: 'Каталог',
  catalogueDescription: 'Акционеры крупнейших компаний, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут объявлены нарушающими общечеловеческие нормы этики и морали. Являясь всего лишь частью общей картины, стремящиеся вытеснить традиционное производство, нанотехнологии и по сей день остаются уделом либералов, которые жаждут быть функционально разнесены на независимые элементы.',
  accordion: {
    1400: {
      date: 'C 1400 по 1499 гг.',
      artists: [
        'Майер, Фридрих Карл',
        'Майер, Юрген',
        'Макбрайд, Уилл',
        'Макке, Гельмут',
        'Макко, Георг',
        'Маннхаймер, Макс',
        'Марк, Мария',
        'Масютин, Василий Николаевич',
        'Мигула, Вальтер',
        'Мульчер, Ганс',
        'Мунте, Людвиг',
        'Мухе, Георг',
        'Мюллер, Отто',
        'Мюллер, Фридрих',
        'Мюллер, Хайко',
        'Мюллер, Ханс Александр'
      ],
    },
    1500: {
      date: 'C 1500 по 1599 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
    1600: {
      date: 'C 1600 по 1699 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
    1700: {
      date: 'C 1700 по 1799 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
    1800: {
      date: 'C 1800 по 1899 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
     ],
    },
    1900: {
      date: 'C 1800 по 1899 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
    2000: {
      date: 'C 1800 по 1899 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
  },
  accordionAPI: [
    {
      id: 1,
      uri: 'Mayer.png',
      artistName: 'Майер, Фридрих Карл',
      years: '23 января 1824 — 24 января 1903',
      description: `В 1844—1848 годах обучался в Мюнхенской академии художеств, где изучал архитектурную живопись Ученик архитектора Августа фон Фойта и художников Йозефа Шлоттауэра и Клеменса фон Циммермана.
      Совершил длительную ознакомительную поездку по Европе. Вернувшись на родину, поселился в Нюрнберге, где в 1855 году стал профессором орнаментного рисунка в школе прикладного искусства.
      Для своих архитектурных картин брал сюжеты, в основном, из Нюрнберга и Аугсбурга. Любил изображать интерьеры, с особым акцентом на строгий рисунок и точные детали при тонком освещении солнечного света.
      Похоронен в Мюнхене на Старом южном кладбище.`
    },
    {
      id: 2,
      uri: 'no_face.jpg',
      artistName: 'Бенедетто ди Биндо',
      years: '1380 — 1417.',
      description: 'Первое документальное упоминание имени художника датируется 20 ноября 1409 года, когда он получил заказ на роспись двух деревянных статуй святых покровителей Сиены — св. Виктора и св. Савиния, выполненных скульптором Франческо ди Вальдамбрино для Сиенского собора. В 1411—1412 годах Бенедетто работал над циклом фресок, посвящённых житию Марии в сакристии этого же собора. Согласно документам, ему помогали три художника — Гвалтьери ди Джованни, Никколо ди Нальдо и Джованни ди Биндино.'
    },
  ]
}
const storeIT = {
  title: 'Каталог',
  catalogueDescription: 'Акционеры крупнейших компаний, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут объявлены нарушающими общечеловеческие нормы этики и морали. Являясь всего лишь частью общей картины, стремящиеся вытеснить традиционное производство, нанотехнологии и по сей день остаются уделом либералов, которые жаждут быть функционально разнесены на независимые элементы.',
  accordion: {
    1400: {
      date: 'C 1400 по 1499 гг.',
      artists: [
        'Габриэль Дель’Отто',
        'Гадди, Гаддо',
        'Галли Бибьена',
        'Галлиари',
        'Гальегос-и-Арноса, Хосе',
        'Гальманини, Гуальтьеро',
        'Гандини, Франческо',
        'Гаулли, Джованни Баттиста',
        'Гварди, Франческо',
        'Гвариенто ди Арпо',
        'Гецци, Пьер Леоне',
        'Гиберти, Лоренцо',
        'Гилья, Оскар',
        'Давид Гирландайо',
        'Гисланди, Витторе',
        'Гуарана, Якопо',
        'Гуарди, Джанантонио',
        'Гуттузо, Ренато'
      ],
    },
    1500: {
      date: 'C 1500 по 1599 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
    1600: {
      date: 'C 1600 по 1699 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
    1700: {
      date: 'C 1700 по 1799 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
    1800: {
      date: 'C 1800 по 1899 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
     ],
    },
    1900: {
      date: 'C 1800 по 1899 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
    2000: {
      date: 'C 1800 по 1899 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
  },
  accordionAPI: [
    {
      id: 1,
      uri: 'otto.jpg',
      artistName: 'Габриэль Дель’Отто',
      years: '20 декабря 1973',
      description: 'Дель’Отто родился 20 декабря в 1973 году, в Риме, Италия. Он получил диплом в творческой зрелости и зарегистрирован в Европейском Институте Дизайна'
    },
    {
      id: 2,
      uri: 'no_face.jpg',
      artistName: 'Бенедетто ди Биндо',
      years: '1380 — 1417.',
      description: 'Первое документальное упоминание имени художника датируется 20 ноября 1409 года, когда он получил заказ на роспись двух деревянных статуй святых покровителей Сиены — св. Виктора и св. Савиния, выполненных скульптором Франческо ди Вальдамбрино для Сиенского собора. В 1411—1412 годах Бенедетто работал над циклом фресок, посвящённых житию Марии в сакристии этого же собора. Согласно документам, ему помогали три художника — Гвалтьери ди Джованни, Никколо ди Нальдо и Джованни ди Биндино.'
    },
  ]
}
const storeBG = {
  title: 'Каталог',
  catalogueDescription: 'Акционеры крупнейших компаний, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут объявлены нарушающими общечеловеческие нормы этики и морали. Являясь всего лишь частью общей картины, стремящиеся вытеснить традиционное производство, нанотехнологии и по сей день остаются уделом либералов, которые жаждут быть функционально разнесены на независимые элементы.',
  accordion: {
    1400: {
      date: 'C 1400 по 1499 гг.',
      artists: [
        'Магритт, Рене',
        'Маду, Жан Батист',
        'Мазерель, Франс',
        'Мари, Бенжамен',
        'Меллери, Ксавье',
        'Менье, Константин',
        'Минне, Жорж',
        'Мишо, Анри',
        'Монталь, Констан',
        'Мортье, Антуан'
      ],
    },
    1500: {
      date: 'C 1500 по 1599 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
    1600: {
      date: 'C 1600 по 1699 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
    1700: {
      date: 'C 1700 по 1799 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
    1800: {
      date: 'C 1800 по 1899 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
     ],
    },
    1900: {
      date: 'C 1800 по 1899 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
    2000: {
      date: 'C 1800 по 1899 гг.',
      artists: [
      'Бенедетто ди Биндо',
      'Бергоньоне, Амброджо',
      'Биссоло, Франческо',
      'Больтраффио, Джованни',
      'Бонсиньори, Франческо',
      'Боттичини, Рафаэлло',
      'Брамантино',
      'Бреа, Людовико',
      'Бьяджо д’Антонио Туччи'
      ],
    },
  },
  accordionAPI: [
    {
      id: 1,
      uri: 'rene.jpg',
      artistName: 'Магритт, Рене',
      years: '21 ноября 1898 — 15 августа 1967',
      description: `Магритт родился в 1898 г. в маленьком бельгийском городке Лессине провинции Эно. Отец художника, Леопольд Магритт (1870-1928[8]), занимался шитьем и торговлей тканями. Мать, Регина (ур. Бертэншам, 1871-1912[9]) до замужества работала модисткой. После нескольких лет в Лессине семья Магриттов переехала в Гилли, где у Рене родились два младших брата: Пол (1902-1975[10]) и Раймон (1900-1970[11]), а оттуда – в Шатле, где и жили с 1904 по 1912 гг. с небольшими перерывами[12]. Там же с 1904 по 1910 г. Рене окончил начальную, а также первый класс средней школы.[13]

      Магритт вспоминал[14], как во время пребывания в Суаньи, где в то время жила его бабка по отцовской линии[15], он и его подружка любили играть на заброшенном кладбище, где регулярно встречали художника, рисующего аллеи. Позднее установили, что им был бельгийский живописец Леон Хьюгенс[15]. Эти встречи оставили маленького Рене с «неясно-волшебным» впечатлением от живописи и с ощущением, что художник наделен сверхъестественной силой.

      В марте 1912 года Регина, мать Рене, утопилась в реке Самбре, что, по-видимому, оказало значительное влияние на художника, однако, вопреки расхожему мнению, не стоит переоценивать влияние этого события на творчество автора. Магритт вынес из детства ряд других, не столь трагичных, но не менее загадочных воспоминаний, про которые сам говорил, что они нашли отражение в его творчестве.

      В феврале 1913 г., чуть более чем через год после самоубийства Регины Магритт, Леопольд и трое мальчиков переехали из Шатле в Шарлеруа.  В августе того же года на местной ярмарке Рене познакомился с двенадцатилетней Жоржеттой Бергер, дочерью мясника. Они дружили почти год до Первой мировой войны и расстались с ее началом, чтобы случайно встретиться только через 6 лет.`
    },
    {
      id: 2,
      uri: 'no_face.jpg',
      artistName: 'Бенедетто ди Биндо',
      years: '1380 — 1417.',
      description: 'Первое документальное упоминание имени художника датируется 20 ноября 1409 года, когда он получил заказ на роспись двух деревянных статуй святых покровителей Сиены — св. Виктора и св. Савиния, выполненных скульптором Франческо ди Вальдамбрино для Сиенского собора. В 1411—1412 годах Бенедетто работал над циклом фресок, посвящённых житию Марии в сакристии этого же собора. Согласно документам, ему помогали три художника — Гвалтьери ди Джованни, Никколо ди Нальдо и Джованни ди Биндино.'
    },
  ]
}

let pageData = storeRU;

const catalogueTemplate = (data) => {
  return `
  <div class="title__wrapper">
    <h2 class="section-title catalogue__title reset">${data.title}</h2>
    <ul class="catalogue__list flex reset">
      <li class="catalogue__item"><img src="./img/flags/image_4.png" alt="флаг" data-lg="storeFR" class="catalogue__img"></li>
      <li class="catalogue__item"><img src="./img/flags/image_6.png" alt="флаг" data-lg="storeDE" class="catalogue__img"></li>
      <li class="catalogue__item"><img src="./img/flags/image_7.png" alt="флаг" data-lg="storeIT" class="catalogue__img"></li>
      <li class="catalogue__item catalogue__item-checked"><img src="./img/flags/image_8.png" alt="флаг" data-lg="storeRU" class="catalogue__img"></li>
      <li class="catalogue__item"><img src="./img/flags/image_5.png" alt="флаг" data-lg="storeBG" class="catalogue__img"></li>
    </ul>
  </div>
  <p class="catalogue__description reset">
   ${data.catalogueDescription}
  </p>
  <div class="catalogue__wrapper">
    <article class="catalogue__article article">
      ${catalogueTemp(data)}
    </article>
    <div id="accordion" class="catalogue__accordion accordion">
      ${accordionItem(data)}
    </div>

  </div>
  `
}


const accordionList = (data, year) => {
  let li = data.accordion[year].artists.reduce((acc, item) => {
    acc +=  `<li class="content__item"><a href="#" class="content__link">${item}</a></li>`;
    return acc;
  }, '');
  return `<ul class="content__list">${li}</ul>`;
}

const accordionItem = data => {
  return Object.keys(data.accordion).reduce((acc, date) => {
    acc += `<button class="accordion__btn" tabindex="1"><span class="accordion__year">${data.accordion[date].date}</span></button>
    <div class="accordion__content content">${accordionList(data, date)}</div>`
    return acc;
  }, '');
}

const render = (string, selector) => {
  document.querySelector(selector).innerHTML = string;
}

let lg = '';
document.querySelector('.catalogue').addEventListener('click', function(e) {
  lg = e.target.dataset.lg;
  if (e.target.classList.contains('catalogue__img')) {
    switch(e.target.dataset.lg) {
      case 'storeFR':
        pageData = storeFR;
        break;
      case 'storeDE':
        pageData = storeDE;
        break;
      case 'storeIT':
        pageData = storeIT;
        break;
      case 'storeBG':
        pageData = storeBG;
        break;
        default:
          pageData = storeRU;
        break;
    }
    render(catalogueTemplate(pageData), '.catalogue');
    document.querySelectorAll('.catalogue__item').forEach(item => {
        item.classList.remove('catalogue__item-checked');
        item.querySelector('.catalogue__img').dataset.lg === lg && item.classList.add('catalogue__item-checked');
      });
    $( "#accordion" ).accordion();
  }
})

const catalogueTemp = (data) => {

  if (data.length === 0) {
  return `
        <img src="./img/modal/wrong.png" alt="" class="article__img">
        <h2 class="article__artist reset"></h2>
        <h3 class="article__years reset"></h3>
        <p class="article__description reset">
        something goes wrong...
        </p>`

    } else if (!data.length) {
      return `
      <img src="./img/catalogue/${data.accordionAPI[0].uri}" alt="${data.accordionAPI[0].artistName}" class="article__img">
      <h2 class="article__artist reset">${data.accordionAPI[0].artistName}</h2>
      <h3 class="article__years reset">${data.accordionAPI[0].years}</h3>
      <p class="article__description reset">
      ${data.accordionAPI[0].description}
      </p>`
    } else {
      const [filtered] = data;
      return `
      <img src="./img/catalogue/${filtered.uri}" alt="${filtered.artistName}" class="article__img">
      <h2 class="article__artist reset">${filtered.artistName}</h2>
      <h3 class="article__years reset">${filtered.years}</h3>
      <p class="article__description reset">
      ${filtered.description}
      </p>`
    }
}

document.querySelector('.catalogue').addEventListener('click', function(e) {
  e.preventDefault();
  data = [...pageData.accordionAPI].filter(el => el.artistName === e.target.innerText);
  if(e.target.classList.contains('content__link')) {
    render(catalogueTemp(data), '.catalogue__article')
  }
})
render(catalogueTemplate(storeRU), '.catalogue')
$( "#accordion" ).accordion();


// scroll

const anchors = document.querySelectorAll('.content__link');
const block = document.querySelector('.catalogue__article');

anchors.forEach(anc => {
  anc.addEventListener('click', (e) => {
    e.preventDefault();
    block.scrollIntoView({
      behavior: 'smooth',
      block: 'start'
    })
  })
})
